In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("Hotel_bookings_updated.csv")
df

,Booking_id,Room_type,Check_in_date,Check_out_date,Stay_duration,Room_price,Room_service_cost,Total_bill,Price_per_day
0,1,Standard,2025-07-23,2025-07-26,3,2000,1928,7928,2642.666667
1,2,Suite,2024-06-30,2024-07-03,3,12000,1692,37692,12564.000000
2,3,Suite,2025-04-30,2025-05-02,2,12000,43,24043,12021.500000
3,4,Standard,2024-07-27,2024-08-03,7,2000,1358,15358,2194.000000
4,5,Standard,2024-06-14,2024-06-18,4,2000,1413,9413,2353.250000
...,...,...,...,...,...,...,...,...,...
9995,9996,Suite,2025-12-07,2025-12-11,4,12000,1508,49508,12377.000000
9996,9997,Standard,2024-04-07,2024-04-13,6,2000,1848,13848,2308.000000
9997,9998,Executive,2024-08-23,2024-08-25,2,8000,1241,17241,8620.500000
9998,9999,Deluxe,2024-09-21,2024-09-23,2,4000,984,8984,4492.000000
9999,10000,Executive,2024-09-22,2024-09-27,5,8000,742,40742,8148.400000

In [3]:
df.head()

,Booking_id,Room_type,Check_in_date,Check_out_date,Stay_duration,Room_price,Room_service_cost,Total_bill,Price_per_day
0,1,Standard,2025-07-23,2025-07-26,3,2000,1928,7928,2642.666667
1,2,Suite,2024-06-30,2024-07-03,3,12000,1692,37692,12564.000000
2,3,Suite,2025-04-30,2025-05-02,2,12000,43,24043,12021.500000
3,4,Standard,2024-07-27,2024-08-03,7,2000,1358,15358,2194.000000
4,5,Standard,2024-06-14,2024-06-18,4,2000,1413,9413,2353.250000

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Booking_id         10000 non-null  int64
 1   Room_type          10000 non-null  object
 2   Check_in_date      10000 non-null  object
 3   Check_out_date     10000 non-null  object
 4   Stay_duration      10000 non-null  int64
 5   Room_price         10000 non-null  int64
 6   Room_service_cost  10000 non-null  int64
 7   Total_bill         10000 non-null  int64
 8   Price_per_day      10000 non-null  float64
dtypes: float64(1), int64(5), object(3)
memory usage: 703.3+ KB

In [5]:
df.isnull().sum() #Missing values

Booking_id           0
Room_type            0
Check_in_date        0
Check_out_date       0
Stay_duration        0
Room_price           0
Room_service_cost    0
Total_bill           0
Price_per_day        0
dtype: int64

In [6]:
df["Check_in_date"] = pd.to_datetime(df["Check_in_date"])
df["Check_out_date"] = pd.to_datetime(df["Check_out_date"])

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Booking_id         10000 non-null  int64
 1   Room_type          10000 non-null  object
 2   Check_in_date      10000 non-null  datetime64[ns]
 3   Check_out_date     10000 non-null  datetime64[ns]
 4   Stay_duration      10000 non-null  int64
 5   Room_price         10000 non-null  int64
 6   Room_service_cost  10000 non-null  int64
 7   Total_bill         10000 non-null  int64
 8   Price_per_day      10000 non-null  float64
dtypes: datetime64[ns](2), float64(1), int64(5), object(1)
memory usage: 703.3+ KB

In [8]:
df = df[df["Stay_duration"] > 0] #stay duration is possible

In [9]:
df = df[df["Total_bill"] > 0] #Revenue cannot be zero or negative.

In [10]:
df.duplicated().sum() #finding duplicates

np.int64(0)

In [11]:
df = df[df["Check_out_date"] > df["Check_in_date"]] #logical data validation

In [12]:
#Recalculate Stay Duration
df["Stay_duration"] = (
    df["Check_out_date"] - df["Check_in_date"]
).dt.days

In [13]:
df.describe() #descriptive statistics analysis

,Booking_id,Check_in_date,Check_out_date,Stay_duration,Room_price,Room_service_cost,Total_bill,Price_per_day
count,10000.00000,10000,10000,10000.000000,10000.000000,10000.000000,10000.000000,10000.000000
mean,5000.50000,2024-12-31 05:35:57.120000,2025-01-04 06:13:32.160000,4.026100,6492.000000,1496.545900,27580.945900,7040.519411
min,1.00000,2024-01-01 00:00:00,2024-01-02 00:00:00,1.000000,2000.000000,0.000000,2002.000000,2000.250000
25%,2500.75000,2024-07-06 00:00:00,2024-07-10 00:00:00,2.000000,2000.000000,747.000000,10843.000000,4031.892857
50%,5000.50000,2025-01-04 00:00:00,2025-01-08 00:00:00,4.000000,8000.000000,1492.000000,20160.000000,8002.309524
75%,7500.25000,2025-06-29 00:00:00,2025-07-02 00:00:00,6.000000,8000.000000,2241.000000,40118.750000,10791.750000
max,10000.00000,2025-12-30 00:00:00,2026-01-06 00:00:00,7.000000,12000.000000,2999.000000,86994.000000,14997.000000
std,2886.89568,NaN,NaN,1.997503,3833.563045,867.338128,21548.768662,3885.489078

In [14]:
df.describe(include='all') #descriptive statistics analysis for both numerical and categorical data

,Booking_id,Room_type,Check_in_date,Check_out_date,Stay_duration,Room_price,Room_service_cost,Total_bill,Price_per_day
count,10000.00000,10000,10000,10000,10000.000000,10000.000000,10000.000000,10000.000000,10000.000000
unique,NaN,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN
top,NaN,Executive,NaN,NaN,NaN,NaN,NaN,NaN,NaN
freq,NaN,2537,NaN,NaN,NaN,NaN,NaN,NaN,NaN
mean,5000.50000,NaN,2024-12-31 05:35:57.120000,2025-01-04 06:13:32.160000,4.026100,6492.000000,1496.545900,27580.945900,7040.519411
min,1.00000,NaN,2024-01-01 00:00:00,2024-01-02 00:00:00,1.000000,2000.000000,0.000000,2002.000000,2000.250000
25%,2500.75000,NaN,2024-07-06 00:00:00,2024-07-10 00:00:00,2.000000,2000.000000,747.000000,10843.000000,4031.892857
50%,5000.50000,NaN,2025-01-04 00:00:00,2025-01-08 00:00:00,4.000000,8000.000000,1492.000000,20160.000000,8002.309524
75%,7500.25000,NaN,2025-06-29 00:00:00,2025-07-02 00:00:00,6.000000,8000.000000,2241.000000,40118.750000,10791.750000
max,10000.00000,NaN,2025-12-30 00:00:00,2026-01-06 00:00:00,7.000000,12000.000000,2999.000000,86994.000000,14997.000000
std,2886.89568,NaN,NaN,NaN,1.997503,3833.563045,867.338128,21548.768662,3885.489078

In [15]:
df.to_csv("Hotel_bookings_cleaned.csv", index=False)